import SideBar from "../../Utilities/SideBar";
import  "../warrnings/Warnnings.css"

export default function Warnnings() {

   
    return (
        <div className='parent'>
            <SideBar />
            <div className="p-4 w-100">
            <div class="container">
        <h1> إرشادات و تنبيهات </h1>
        
        <div className="section alert">
            <h2>تنبيهات</h2>
            <ul>
                <li>لا يُسمح للموظفين باستخدام إيميل الأدمن الإلكتروني.</li>
                <li>بمجرد أن يصدر الموظف الفاتورة، لن يكون مسموح له تعديل أي مبالغ مالية داخل الفاتورة أو إلغاؤها إلا من خلال الادمن وذلك باستخدام خاصية التعديل.</li>
                <li>فقط الأدمن يحق له إضافة موظف أو تعديل بيانات موظف.</li>
                <li>فقط الأدمن يحق له تعديل أو إضافة غرفة.</li>
                <li>يجب على كل موظف استخدام الإيميل الخاص به.</li>
                <li>                لا تقم بكتابة أي مبالغ مالية بالسالب أو بدءها بصفر من اليسار. في حال حدوث ذلك بالخطأ، يرجى إبلاغ الأدمن لتصحيح المبالغ المالية غير الصحيحة.
                </li>


                <li>             إذا قمت بإصدار فاتورة نقل وأردت تعديل الرسوم أو التأمين، يجب عليك أن تخبر الأدمن لإجراء التعديلات المطلوبة.
                </li>







                <li>                إذا كان النقل يتم خلال فترة الحجز، يجب أن يكون العميل مستوفيًا كافة المبالغ المالية المطلوبة منه، لأن نظام الحجز البرمجي يتعامل بناءً على هذا الأساس. في حالة حدوث خطأ من الموظف وعدم استيفاء العميل لكافة المبالغ، يجب على الموظف بعد النقل إضافة مبلغ الاستكمال في خانة الرسوم وإصدار فاتورة جديدة مع التوضيح في الملاحظات."
                </li>







                <li>إذا قام الموظف بإدخال مبالغ مالية خاطئة في الفاتورة ولم يكتشف الخطأ إلا بعد أن قام العميل بصرف الفاتورة من الخزينة، فعليه أن يخبر المسؤول  ( الأدمن ) بذلك ليقوم بتسوية الفاتورة وتعديلها مع كتابة المبالغ المطلوبة استردادها أو دفعها في خانة الملاحظات، حتى لا يقوم العميل بصرف نفس الفاتورة مرتين.</li>



                <li>

                في حالة البحث بالاسم في الأرشيف، إذا كان هناك عميلان يحملان نفس الاسم أو يتشابه الاسم الثنائي مع الرباعي لعميلين مختلفين، فلن يتمكن النظام من التمييز بينهما. لذلك، يجب البحث باستخدام الاسم الكامل للعميل لتمكين النظام من التفريق بينهما، ومن ثم التأكد من أن الاسم في النتائج هو نفس الاسم الذي أدخلته في خانة البحث.
</li>


<li>

                في حال ارتكابك خطأ في بيانات الفاتورة، لا تقم بإصدار فاتورة جديدة مباشرةً وتغيير حالتها  ( حجز جديد - استكمال - خروج - الغاء حجز ). بدلاً من ذلك، قم بتعديل البيانات الخاطئة أولاً، ثم أصدر فاتورة جديدة ببيانات صحيحة.
          </li>
          
            </ul>
        </div>
        
        <div className="section instructions">
            <h2>الإرشادات</h2>
            <div className="section">
                <h2>إدارة الموظفين</h2>
                <ul>
                    <li>تُستخدم لإضافة وتعديل بيانات الموظفين.</li>
                    <li>تأكد من تحديث جميع البيانات بشكل دوري لضمان دقتها.</li>
                </ul>
            </div>
            <div className="section">
                <h2>إدارة الغرف</h2>
                <ul>
                    <li>تُستخدم لإضافة أو تعديل سعر الغرفة أو رقمها أو نوعها.</li>
                    <li>راقب التغييرات في الأسعار بشكل منتظم لضمان التناسق مع السياسة العامة للفندق.</li>
                </ul>
            </div>
            <div className="section">
                <h2>سجل العملاء</h2>
                <ul>
                    <li>يُستخدم لإضافة أو تعديل بيانات العميل.</li>
                    <li>يمكن البحث في الأرشيف باستخدام اسم العميل أو رقم هويته الشخصية خلال فترة زمنية معينة لعرض جميع الغرف التي أقام فيها هذا العميل خلال تلك الفترة.</li>
                    <li>يمكن البحث باستخدام رقم الغرفة لعرض أسماء العملاء الذين أقاموا في تلك الغرفة خلال فترة زمنية محددة.</li>
                    <li>تأكد من حماية بيانات العملاء واتباع سياسات الخصوصية بشكل صارم.</li>
                </ul>
            </div>
            <div className="section">
                <h2>طباعة الفاتورة</h2>
                <ul>
                    <li>تُستخدم لطباعة آخر حالة للفاتورة باستخدام البحث برقم الفاتورة أو رقم هوية العميل الشخصية.</li>
                    <li>لا يمكن تعديل الفاتورة عند الطباعة.</li>
                    <li>تحتوي كل الفواتير الصادرة على اسم البريد الإلكتروني الخاص بالموظف الذي أصدر أو طبع الفاتورة، بالإضافة إلى تاريخ ووقت الإصدار.</li>
                    <li>راجع الفواتير بانتظام للتأكد من دقتها قبل الطباعة.</li>
                </ul>
            </div>
            <div className="section">
                <h2>إصدار الفواتير</h2>
                <ul>
                    <li>تُستخدم لاستخراج فاتورة للعميل حسب مرحلة الحجز، سواء كانت فاتورة حجز أو استكمال أو خروج وسداد التأمين أو نقل حجز.</li>
                    <li>يجب توضيح البيانات المالية الخاصة بكل مرحلة من الفاتورة، بالإضافة إلى التواريخ المتعلقة بهذه المرحلة.</li>
                    <li>تأكد من أن جميع البيانات المالية واضحة وصحيحة لتجنب أي لبس مع العملاء.</li>
                </ul>
            </div>
            <div className="section">
                <h2>تعديل فاتوره </h2>
                <ul>
                    <li>عند تعديل الفاتورة، سيتم توضيح استخدام خاصية التعديل بكتابة تاريخ التعديل وكتابة كلمة "تعديل" داخل النظام للإشارة إلى أن هذه الفاتورة قد تم تعديلها باستخدام بريد الأدمن الإلكتروني.</li>
                    <li>سجل جميع التعديلات بشكل دقيق لمتابعة أي تغييرات قد تحدث.</li>
                </ul>
            </div>
        </div>
    </div>
            </div>
        </div>
    )
}

